# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы (надо погуглить).
integer_type :int = 1
float_type :float = 0.2
bool_type :bool = True
string_type :str = 'hello'
null_type :None = None
print('Данный тип переменной, ', type(integer_type))
print('Данный тип переменной, ', type(float_type))
print('Данный тип переменной, ', type(bool_type))
print('Данный тип переменной, ', type(string_type))
print('Данный тип переменной, ', type(null_type))
