#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
a=int(input('a = '))
b=int(input('b = '))
print('Summ = ', a+b)
print('Raznost = ', a-b)
print('Proizvedenie = ', a*b)
print('Chastnoe = ', a/b)
print('Celochislennoe = ', a//b)
print('Ostatok = ', a%b)
print('Stepen a = ', a*a)
print('Stepen b = ', b*b)


